# Project-python_1_KSI-(Amazon)

# # By Farhana Hoque

In [1]:
# Import necessary libraries
import pandas as pd

# Load the dataset with a specified encoding
df = pd.read_csv(r"C:\Users\User\Downloads\amazon.csv", encoding='latin1')

In [2]:
# 1. Display Top 10 Rows of The Dataset
top_10_rows = df.head(10)
top_10_rows

   year state    month  number      date
0  1998  Acre  Janeiro     0.0  1/1/1998
1  1999  Acre  Janeiro     0.0  1/1/1999
2  2000  Acre  Janeiro     0.0  1/1/2000
3  2001  Acre  Janeiro     0.0  1/1/2001
4  2002  Acre  Janeiro     0.0  1/1/2002
5  2003  Acre  Janeiro    10.0  1/1/2003
6  2004  Acre  Janeiro     0.0  1/1/2004
7  2005  Acre  Janeiro    12.0  1/1/2005
8  2006  Acre  Janeiro     4.0  1/1/2006
9  2007  Acre  Janeiro     0.0  1/1/2007

In [3]:
# 2. Check Last 10 Rows
last_10_rows = df.tail(10)
last_10_rows

      year      state     month  number      date
6444  2007  Tocantins  Dezembro    13.0  1/1/2007
6445  2008  Tocantins  Dezembro     7.0  1/1/2008
6446  2009  Tocantins  Dezembro    46.0  1/1/2009
6447  2010  Tocantins  Dezembro    72.0  1/1/2010
6448  2011  Tocantins  Dezembro   105.0  1/1/2011
6449  2012  Tocantins  Dezembro   128.0  1/1/2012
6450  2013  Tocantins  Dezembro    85.0  1/1/2013
6451  2014  Tocantins  Dezembro   223.0  1/1/2014
6452  2015  Tocantins  Dezembro   373.0  1/1/2015
6453  2016  Tocantins  Dezembro   119.0  1/1/2016

In [4]:
# 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)
dataset_shape = df.shape
dataset_shape

(6454, 5)

In [5]:
# 4. Getting Information About Our Dataset
dataset_info = df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   object
 3   number  6454 non-null   float64
 4   date    6454 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [6]:
# 5. Check For Duplicate Data and Drop Them
df.drop_duplicates(inplace=True)

In [7]:
# 6. Check Null Values In The Dataset
null_values = df.isna().sum()

# Display the null values
null_values

year      0
state     0
month     0
number    0
date      0
dtype: int64

In [8]:
# 7. Get Overall Statistics About The Dataframe
overall_stats = df.describe()
overall_stats

              year       number
count  6422.000000  6422.000000
mean   2007.490969   108.815178
std       5.731806   191.142482
min    1998.000000     0.000000
25%    2003.000000     3.000000
50%    2007.000000    24.497000
75%    2012.000000   114.000000
max    2017.000000   998.000000

In [21]:
# 8. Rename Month Names To English


# Ensure proper date parsing
df['date'] = pd.to_datetime(df['date'])


# Fill NaN values in the 'month' column based on the 'date' column
df['month'] = df['date'].dt.month_name()

# Dictionary mapping month names to English
month_dict = {
    'Janeiro': 'January',
    'Fevereiro': 'February',
    'Março': 'March',
    'Abril': 'April',
    'Maio': 'May',
    'Junho': 'June',
    'Julho': 'July',
    'Agosto': 'August',
    'Setembro': 'September',
    'Outubro': 'October',
    'Novembro': 'November',
    'Dezembro': 'December'
}

# Rename month column to English names
df['month']= df['month'].map(month_dict)

# Display the updated DataFrame
print(df.head())

   year state month  number       date
0  1998  Acre   NaN     0.0 1998-01-01
1  1999  Acre   NaN     0.0 1999-01-01
2  2000  Acre   NaN     0.0 2000-01-01
3  2001  Acre   NaN     0.0 2001-01-01
4  2002  Acre   NaN     0.0 2002-01-01

In [11]:
# 9. Total Number of Fires Registered
total_fires = df['number'].sum()
total_fires

698811.073

In [12]:
# 10. In Which Month Maximum Number of Forest Fires Were Reported?
max_fires_month = df.loc[df['number'].idxmax()]['month']
max_fires_month

'January'

In [13]:
# 11. In Which Year Maximum Number of Forest Fires Was Reported?
max_fires_year = df.loc[df['number'].idxmax()]['year']
max_fires_year

2008

In [14]:
# 12. In Which State Maximum Number of Forest Fires Was Reported?
max_fires_state = df.loc[df['number'].idxmax()]['state']
max_fires_state

'Amazonas'

In [15]:
# 13. Find Total Number of Fires Were Reported In Amazonas
total_fires_amazonas = df[df['state'] == 'Amazonas']['number'].sum()
total_fires_amazonas

30650.129

In [16]:
# 14. Display Number of Fires Were Reported In Amazonas (Year-Wise)
amazonas_yearly_fires = df[df['state'] == 'Amazonas'].groupby('year')['number'].sum()
amazonas_yearly_fires

year
1998     946.000
1999    1061.000
2000     853.000
2001    1297.000
2002    2852.000
2003    1524.268
2004    2298.207
2005    1657.128
2006     997.640
2007     589.601
2008    2717.000
2009    1320.601
2010    2324.508
2011    1652.538
2012    1110.641
2013     905.217
2014    2385.909
2015    1189.994
2016    2060.972
2017     906.905
Name: number, dtype: float64

In [17]:
# 15. Display Number of Fires Were Reported In Amazonas (Day-Wise)
amazonas_daily_fires = df[df['state'] == 'Amazonas'].groupby('date')['number'].sum()
amazonas_daily_fires

date
1998-01-01     946.000
1999-01-01    1061.000
2000-01-01     853.000
2001-01-01    1297.000
2002-01-01    2852.000
2003-01-01    1524.268
2004-01-01    2298.207
2005-01-01    1657.128
2006-01-01     997.640
2007-01-01     589.601
2008-01-01    2717.000
2009-01-01    1320.601
2010-01-01    2324.508
2011-01-01    1652.538
2012-01-01    1110.641
2013-01-01     905.217
2014-01-01    2385.909
2015-01-01    1189.994
2016-01-01    2060.972
2017-01-01     906.905
Name: number, dtype: float64

In [18]:
# 16. Find Total Number of Fires Were Reported In 2015 And Visualize Data Based on Each ‘Month’
fires_2015 = df[df['year'] == 2015].groupby('month')['number'].sum()
fires_2015

month
January    41208.292
Name: number, dtype: float64

In [19]:
# 17. Find Average Number of Fires Were Reported From Highest to Lowest (State-Wise)
avg_fires_statewise = df.groupby('state')['number'].mean().sort_values(ascending=False)
avg_fires_statewise

state
Sao Paulo           213.896226
Mato Grosso         203.479975
Bahia               187.222703
Piau                158.174674
Goias               157.721841
Minas Gerais        156.800243
Tocantins           141.037176
Amazonas            128.243218
Ceara               127.314071
Paraiba             111.073979
Maranhao            105.142808
Pará                102.561272
Pernambuco          102.502092
Roraima             102.029598
Santa Catarina      101.924067
Amapa                91.345506
Rondonia             84.876272
Acre                 77.255356
Rio                  64.698515
Espirito Santo       27.389121
Alagoas              19.271967
Distrito Federal     14.899582
Sergipe              13.543933
Name: number, dtype: float64

In [20]:

# Display the original DataFrame
print("Original DataFrame:")
print(df.head())

# 18. Find the state names where fires were reported in 'dec' month
december_states = df[df['month'] == 'December']['state'].unique()

# Display the state names
print("\nState names where fires were reported in 'December':")
print(december_states)

Original DataFrame:
   year state    month  number       date
0  1998  Acre  January     0.0 1998-01-01
1  1999  Acre  January     0.0 1999-01-01
2  2000  Acre  January     0.0 2000-01-01
3  2001  Acre  January     0.0 2001-01-01
4  2002  Acre  January     0.0 2002-01-01

State names where fires were reported in 'December':
[]